<a href="https://colab.research.google.com/github/doublejone831/COLAB/blob/main/Practice2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

통계함수 이용방법

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [4]:
import pandas as pd

In [6]:
data = pd.read_csv('/content/drive/MyDrive/Pandas/tutorial data/data03.csv')
data

    도시       인구수        남자        여자
0   서울   9741381   4757642   4984229
1   부산   3416918   1680933   1735985
2   인천   2925967   1472081   1453886
3   대구   2453041   1218326   1234715
4   대전   1525849    765718    760131
5   광주   1496172    745122    751050
6   수원   1193894    601097    592797
7   울산   1147037    589233    557804
8   고양   1068641    523803    544838
9   용인   1061440    526824    534617
10  총합  26030340  12880779  13150052

In [7]:
data['도시'].unique() #컬럼의 중복된 경우를 제외하고 출력

array(['서울', '부산', '인천', '대구', '대전', '광주', '수원', '울산', '고양', '용인', '총합'],
      dtype=object)

In [8]:
data['도시'].value_counts() #고유 값들의 빈도 출력

고양    1
용인    1
부산    1
총합    1
수원    1
울산    1
인천    1
대전    1
서울    1
광주    1
대구    1
Name: 도시, dtype: int64

수치 관련 연산들

In [9]:
df = data.iloc[:10, 1:] #수치 데이터만 저장
df

       인구수       남자       여자
0  9741381  4757642  4984229
1  3416918  1680933  1735985
2  2925967  1472081  1453886
3  2453041  1218326  1234715
4  1525849   765718   760131
5  1496172   745122   751050
6  1193894   601097   592797
7  1147037   589233   557804
8  1068641   523803   544838
9  1061440   526824   534617

In [10]:
df.sum() #총합

인구수    26030340
남자     12880779
여자     13150052
dtype: int64

In [11]:
df.max() #최대

인구수    9741381
남자     4757642
여자     4984229
dtype: int64

In [12]:
df['인구수'].idxmax() #최댓값의 로우 인덱스 반환

0

In [13]:
data.loc[df['인구수'].idxmax()]['도시'] #맥스값의 도시명 찾기

'서울'

In [14]:
df.min() #최솟값

인구수    1061440
남자      523803
여자      534617
dtype: int64

In [15]:
df['인구수'].idxmin()

9

In [16]:
data.loc[df['인구수'].idxmin()]['도시']

'용인'

In [18]:
df.mean() #평균

인구수    2603034.0
남자     1288077.9
여자     1315005.2
dtype: float64

In [19]:
df.median() #중간값

인구수    1511010.5
남자      755420.0
여자      755590.5
dtype: float64

In [20]:
df.var() #분산

인구수    6.996348e+12
남자     1.658060e+12
여자     1.843244e+12
dtype: float64

In [21]:
df.std() #표준 편차

인구수    2.645061e+06
남자     1.287657e+06
여자     1.357661e+06
dtype: float64

컬럼 연산
파이썬의 모든 연산자들 사용가능

In [22]:
data['남자 + 여자'] = data['남자'] + data['여자'] #컬럼간의 연산은 간은 로우의 값끼리 연산됨
data

    도시       인구수        남자        여자   남자 + 여자
0   서울   9741381   4757642   4984229   9741871
1   부산   3416918   1680933   1735985   3416918
2   인천   2925967   1472081   1453886   2925967
3   대구   2453041   1218326   1234715   2453041
4   대전   1525849    765718    760131   1525849
5   광주   1496172    745122    751050   1496172
6   수원   1193894    601097    592797   1193894
7   울산   1147037    589233    557804   1147037
8   고양   1068641    523803    544838   1068641
9   용인   1061440    526824    534617   1061441
10  총합  26030340  12880779  13150052  26030831

In [23]:
data['남자 - 여자'] = data['남자'] - data['여자']
data

    도시       인구수        남자        여자   남자 + 여자  남자 - 여자
0   서울   9741381   4757642   4984229   9741871  -226587
1   부산   3416918   1680933   1735985   3416918   -55052
2   인천   2925967   1472081   1453886   2925967    18195
3   대구   2453041   1218326   1234715   2453041   -16389
4   대전   1525849    765718    760131   1525849     5587
5   광주   1496172    745122    751050   1496172    -5928
6   수원   1193894    601097    592797   1193894     8300
7   울산   1147037    589233    557804   1147037    31429
8   고양   1068641    523803    544838   1068641   -21035
9   용인   1061440    526824    534617   1061441    -7793
10  총합  26030340  12880779  13150052  26030831  -269273

In [24]:
data['남자 - 여자의 절댓값'] = data['남자 - 여자'].abs()
data

    도시       인구수        남자        여자   남자 + 여자  남자 - 여자  남자 - 여자의 절댓값
0   서울   9741381   4757642   4984229   9741871  -226587        226587
1   부산   3416918   1680933   1735985   3416918   -55052         55052
2   인천   2925967   1472081   1453886   2925967    18195         18195
3   대구   2453041   1218326   1234715   2453041   -16389         16389
4   대전   1525849    765718    760131   1525849     5587          5587
5   광주   1496172    745122    751050   1496172    -5928          5928
6   수원   1193894    601097    592797   1193894     8300          8300
7   울산   1147037    589233    557804   1147037    31429         31429
8   고양   1068641    523803    544838   1068641   -21035         21035
9   용인   1061440    526824    534617   1061441    -7793          7793
10  총합  26030340  12880779  13150052  26030831  -269273        269273

In [25]:
data['성비'] = data['남자']/ data['여자']
data

    도시       인구수        남자        여자   남자 + 여자  남자 - 여자  남자 - 여자의 절댓값        성비
0   서울   9741381   4757642   4984229   9741871  -226587        226587  0.954539
1   부산   3416918   1680933   1735985   3416918   -55052         55052  0.968288
2   인천   2925967   1472081   1453886   2925967    18195         18195  1.012515
3   대구   2453041   1218326   1234715   2453041   -16389         16389  0.986726
4   대전   1525849    765718    760131   1525849     5587          5587  1.007350
5   광주   1496172    745122    751050   1496172    -5928          5928  0.992107
6   수원   1193894    601097    592797   1193894     8300          8300  1.014001
7   울산   1147037    589233    557804   1147037    31429         31429  1.056344
8   고양   1068641    523803    544838   1068641   -21035         21035  0.961392
9   용인   1061440    526824    534617   1061441    -7793          7793  0.985423
10  총합  26030340  12880779  13150052  26030831  -269273        269273  0.979523

In [27]:
data['여자100명장_남자수'] = data['성비']*100
data

    도시       인구수        남자  ...  남자 - 여자의 절댓값        성비  여자100명장_남자수
0   서울   9741381   4757642  ...        226587  0.954539    95.453921
1   부산   3416918   1680933  ...         55052  0.968288    96.828774
2   인천   2925967   1472081  ...         18195  1.012515   101.251474
3   대구   2453041   1218326  ...         16389  0.986726    98.672649
4   대전   1525849    765718  ...          5587  1.007350   100.735005
5   광주   1496172    745122  ...          5928  0.992107    99.210705
6   수원   1193894    601097  ...          8300  1.014001   101.400142
7   울산   1147037    589233  ...         31429  1.056344   105.634416
8   고양   1068641    523803  ...         21035  0.961392    96.139219
9   용인   1061440    526824  ...          7793  0.985423    98.542321
10  총합  26030340  12880779  ...        269273  0.979523    97.952305

[11 rows x 9 columns]

비교연산자

In [29]:
data['인구수'] >= 2000000

0      True
1      True
2      True
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10     True
Name: 인구수, dtype: bool

In [30]:
(data['인구수'] >= 2000000).sum()

5

In [31]:
data[data['인구수'] >= 2e+6]

    도시       인구수        남자  ...  남자 - 여자의 절댓값        성비  여자100명장_남자수
0   서울   9741381   4757642  ...        226587  0.954539    95.453921
1   부산   3416918   1680933  ...         55052  0.968288    96.828774
2   인천   2925967   1472081  ...         18195  1.012515   101.251474
3   대구   2453041   1218326  ...         16389  0.986726    98.672649
10  총합  26030340  12880779  ...        269273  0.979523    97.952305

[5 rows x 9 columns]

In [32]:
data[data['인구수'] >= 2e+6]['도시']

0     서울
1     부산
2     인천
3     대구
10    총합
Name: 도시, dtype: object

In [37]:
data[data['인구수'] >= data['인구수'][:-1].median()]['도시'][:-1] #총합 제외 중앙값 이상인 도시들의 이름

0    서울
1    부산
2    인천
3    대구
4    대전
Name: 도시, dtype: object

In [38]:
data[data['남자'] > data['여자']]['도시']

2    인천
4    대전
6    수원
7    울산
Name: 도시, dtype: object